let films = [
    {
        name: 'Энакин Скайуокер',
        marks: "Рыцарь-Джедай",
        actors: "Раса: Человек",
        Image: "img/pers-1.png",
        about: "Энакин Скайуокер (англ. Anakin Skywalker, сокращённо Эни) — легендарный чувствительный к Силе человек, мужчина, который служил Галактической Республике как рыцарь-джедай, позже служивший Галактической Империи и командовавший её войсками, как Лорд ситхов Дарт Вейдер. Рождённый Шми Скайуокер, в юности стал тайным мужем сенатора с Набу, Падме Амидалы Наберри. Он был отцом гранд-мастера Люка Скайуокера, рыцаря-джедая Леи Органы-Соло и дедом Бена Скайуокера. Далёкими потомками Энакина Скайуокера были Нат, Кол и Кейд Скайуокеры. Хотя, будучи взрослым, Энакин стал ключевой фигурой в Галактике, не смотря на низкое происхождение. Первые годы своей жизни он провёл на Татуине вместе со своей матерью в качестве раба. В 32 ДБЯ Скайуокер встретился с мастером-джедаем Квай-Гон Джинном и Падме Амидалой, королевой Набу на которой будучи взрослым женился. Вскоре после этого Энакин победил на гонках Бунта Ив Классик, тем самым завоевав свободу у проспорившего хозяина Уотто, и, с трудом и сожалением расставшись с матерью, улетел с Татуина вместе с рыцарем Квай-Гоном. На Набу, несмотря на свой юный возраст, он отважился принять участие в битве против Торговой федерации, что, как ни странно, увенчалось успехом: Энакин уничтожил центр контроля дроидов. Вскоре после этого он вступил в Орден джедаев, став падаваном Оби-Вана Кеноби. Джедаи верили, что Энакин был Избранным, который, согласно пророчеству джедаев, должен был восстановить баланс Силы, уничтожив ситхов. Однако совет сначала не хотел его обучать, так как магистр Йода почувствовал в нём опасность, но рыцарь Оби-ван убедил магистров взять Энакина, несмотря на непригодный для начала обучения возраст и его страх за мать, который мог привести на тёмную сторону.",
    
},

    {
        name: 'Оби-ван Кеноби',
        marks: "Мастер-Джедай",
        actors: "раса: Человек",
        Image: "img/pers-2.png",
        about: "Оби-Ван Кеноби (англ. Obi-Wan Kenobi), позднее известный как Бен Кеноби — легендарный мастер-джедай. Он был падаваном Квай-Гона Джинна, а затем, после его смерти, взял в ученики Энакина Скайуокера. После падения Энакина на Тёмную сторону стал учителем его сына — Люка Скайуокера. В 32 ДБЯ Оби-Ван стал первым джедаем, который впервые приблизительно за тысячу лет нанес поражение лорду ситхов, победив Дарта Мола во время Второй битвы за Тид. Являлся мастером третьей формы, Соресу, в бою на световых мечах. Кеноби сражался в звании высшего генерала-джедая на стороне Галактической Республики в течение Войн клонов, заработав прозвище «посредник» («переговорщик»). Оби-Ван лично положил конец угрозе, которую представлял собой генерал Гривус. Кеноби был одним из последних членов Совета джедаев во времена заката Старой Республики, а также одним из немногих джедаев, переживших приказ 66. После дуэли со своим бывшим учеником на Мустафаре Оби-Ван отправился в изгнание на Татуин, чтобы приглядывать за подрастающим Люком Скайуокером. В 0 ДБЯ он вместе с Люком, Чубаккой и Ханом Соло проник на Звезду Смерти I, где во второй раз сразился с Вейдером. Через некоторое время после начала дуэли Оби-Ван по необъяснимым причинам прекратил сражение, высоко подняв свой меч над головой, фактически подставляясь под удар бывшего ученика. После удара «сай ток» Вейдера Оби-Ван упал, и его тело растворилось в Силе. Физическая смерть, однако, не привела к полному исчезновению Оби-Вана. Он впоследствии являлся Люку Скайуокеру в смутных видениях и в виде голоса, а несколько раз даже в облике призрака силы."
    },

    {
        name: 'Йода',
        marks: "Гранд-мастер-джедай",
        actors: "Раса: Неизвесно",
        Image: "img/pers-3.png",
        about: "Йода (англ. Yoda) — гранд-мастер Ордена джедаев, был одним из самых сильных и мудрых джедаев своего времени. Место в Совете получил спустя примерно сотню лет после рождения. Обладая долголетием, он достиг титула гранд-мастера в возрасте примерно 600 лет. Йода сумел выжить во время приказа 66. После неудачной дуэли с Дартом Сидиусом ушел в добровольное изгнание на планету Дагоба, где и умер естественной смертью в 4 ПБЯ. Родная планета и раса Йоды неизвестны.Магистр Йода был одним из сильнейших джедаев своего времени. Он был самым мудрым из них. Во владении световым мечом с Йодой могли сравниться только Мейс Винду, Энакин Скайуокер, Оби-Ван Кеноби, граф Дуку и Дарт Сидиус."
    },

    {
        name: 'Квай-Гон Джинн',
        marks: "Мастер-джедай",
        actors: "Раса: Человек",
        Image: "img/pers-4.png",
        about: "Квай-Гон Джинн (англ. Qui-Gon Jinn) был уважаемым, но вместе с тем независимым и незаурядным мастером-джедаем, мужчиной. Ранее Квай-Гон являлся падаваном графа Дуку, а затем стал наставником Оби-Вана Кеноби. Джинн часто конфликтовал с Советом джедаев. Он глубоко чувствовал Живую Силу, которая часто сподвигала его на путешествия чтобы помочь, казалось бы, слабым и бесполезным формам жизни. Несмотря на его оппозицию Совету, многие джедаи считали Джинна мудрым и рассудительным, а также разделяли его взгляды (которые иногда совпадали со взглядами графа Дуку, его бывшего учителя). Квай-Гон верил, что Сила присутствует в большинстве живых существ, окружает и проникает в них, таким образом, связывая воедино всё живое. Джинн служил Галактической Республике и Ордену джедаев всю свою жизнь, участвовал в Гиперпространственной войне Старка против Невидимого фронта, наиболее прославившись во время вторжения на Набу. Именно Джинн обнаружил Избранного, Энакина Скайуокера, на Татуине во время Набуанского кризиса, и в значительной мере был ответственен за его обучение. Даже после своей смерти в 32 ДБЯ на Набу от руки Дарта Мола, Джинн играл важную роль в сохранении наследия Ордена джедаев."
    },
    {
        name: 'Мейс Винду',
        marks: "Мастер-джедай",
        actors:"Раса: Человек",
        Image: "img/pers-5.png",
        about:  "Мейс Винду (англ. Mace Windu) —  мастер-джедай и член Высшего совета джедаев, живший в последние годы существования Галактической Республики. Он был одним из самых влиятельных, мудрых и талантливых джедаев, защищая Орден джедаев и продвигая его древние традиции в тёмные для Республики времена. Когда кризис сепаратистов спровоцировал Войны клонов, Винду и другие джедаи объединились для защиты Республики и возглавили Великую армию Республики. В начале Войн клонов Винду руководил группой из 212 джедаев, которые отправились на Джеонозис, чтобы спасти рыцаря-джедая Оби-Вана Кеноби, его падавана Энакина Скайуокера и сенатора Падме Амидалу от казни. Между сепаратистами, которые устроили казнь, и республиканцами развязалась битва, во время которой Винду убил наёмника Джанго Фетта световым мечом. Сражение на Джеонозисе стало началом Войн клонов.На протяжении всей войны Винду служил генералом на многочисленных фронтах, а также являлся советником Верховного Канцлера Шива Палпатина. Кроме того, он принимал участие в дипломатических миссиях, несмотря на своё презрение к политике. Его подвиги на линии фронта служили напоминанием о его репутации превосходного воина. К концу войны джедаи узнали, что Верховный канцлер Палпатин и тёмный лорд ситхов Дарт Сидиус на самом деле один и тот же человек. Мейс Винду вместе с мастерами Сэси Тийном, Китом Фисто и Агеном Коларом отправились в кабинет Палпатина, чтобы арестовать ситха. Сидиус легко расправился с Тийном, Коларом и Фисто, но в итоге был побеждён Винду. Мейс занёс руку над ситхом для смертельного удара, но та тут же была отрублена Энакином Скайуокером, подоспевшим к месту поединка. Канцлер немедленно атаковал безоружного мастера Молниями Силы, выбросив его в окно, и Энакин Скайуокер стал новым учеником Сидиуса. Действия Винду стали поводом для Палпатина заклеймить джедаев как предателей Республики. Канцлер отдал Приказ 66, в результате которого солдаты-клоны по всей Галактике напали на джедаев, убив большинство из них и положив конец Ордену. Палпатин превратил Республику в Галактическую Империю, а новый режим способствовал распространению негативного представления о джедаях. Через пропаганду Империя представила Винду как лидера преступной группировки джедаев, подстроивших Войны клонов. Тем не менее, несмотря на пропаганду, многие вспоминали о подвигах Мейса Винду с теплотой. Генерал Чам Синдулла, который сражался вместе с Винду во время битвы при Рилоте, с большим уважением вспоминал джедая и рассказывал, как тот помог ему освободить Рилот во время войны."
    },
    {
        name: 'Дарт-Сидиус',
        marks: "Гранд-лорд Ситхов",
        actors: "Раса: Человек",
        Image: "img/pers-6.png",
        about: "Палпати́н, также известный как Дарт Си́диус (англ. Palpatine/Darth Sidious), — последний Верховный канцлер Республики и первый император Галактической Империи, обладавший огромной мощью: его не смогли убить ни Мейс Винду, ни Йода, ни другие джедаи. Он был тёмным лордом ситхов, который придерживался Правила двух, правила Ордена лордов ситхов и был самым влиятельным лордом, которого когда-либо знала Галактика. Также он имел острый интеллект и был способен предвидеть различные варианты будущего: фактически именно он превратил Старую Республику в Империю и уничтожил почти всех джедаев. На всё это у Палпатина ушли десятилетия упорного труда.Ситх начал свой путь к абсолютной власти, став сенатором. Затем, используя свои способности к манипуляции, хитроумие и могущество тёмной стороны Силы, он стал Верховным канцлером и пробыл в этой должности тринадцать лет, постепенно увеличивая свою власть и превращая демократический режим Республики в диктатуру. Все эти годы и после Палпатин постоянно устраивал различные интриги, такие как клонирование джедая Джоруса К'баота и постройка фабрики по производству своих же клонов на Биссе; убийства и запугивания неугодных политических противников; развязывание различных военных и политических конфликтов; постоянное внесение поправок в Конституцию, наделяющих его всё новыми полномочиями, и так далее. Именно Палпатин вверг Галактику в сепаратистский кризис и Войны клонов, именно он был руководителем и манипулятором обеих сторон этого конфликта — Республики и Конфедерации независимых систем; именно он руководил всем ходом этой войны, направленной на уничтожение джедаев, которые могли помешать ему достичь абсолютной власти. В 19 ДБЯ Палпатин склонил на тёмную сторону Энакина Скайуокера, который получил после этого имя Дарт Вейдер. Это событие стало роковым для всех жителей галактики и оставшихся в живых джедаев. В тот же день Палпатин преобразовал Старую Республику в Галактическую Империю. На протяжении двух десятков лет Палпатин единолично правил Галактикой, окончательно уничтожив последние оплоты демократии, включая Сенат. В 4 ПБЯ, во время Эндорской битвы, Сидиус погиб на борту второй Звезды Смерти в возрасте 86 лет от руки своего ученика Дарта Вейдера, который с помощью сына вернулся на cветлую сторону и восстановил равновесие в Силе. Тайные знания древних ситхов помогли Сидиусу сохранить своё сознание после смерти. Дух ситха отправился на Бисс и вселился в тело своего клона. После этого он возродил Империю и был близок к уничтожению Новой Республики, но вскоре почти всех клонов Палпатина уничтожил Карнор Джакс. На Ондероне он попытался вселиться в тело Энакина Соло, однако был подстрелен его отцом; затем дух ситха перехватил смертельно раненный джедай Эмпатоджейос Бранд, намертво заключил его в себе и, погибнув, унёс дух Палпатина с собой в Силу. Так Дарт Сидиус, один из величайших в истории лордов ситхов, был окончательно побеждён."
    },
    {
        name: 'Дарт-Мол',
        marks: "Лорд Ситхов",
        actors: "Раса: Датомирская",
        Image: "img/pers-7.png",
        about: "Дарт Мол (англ. Darth Maul) — тёмный владыка ситхов, живший в последние годы существования Галактической Республики. Он родился на Датомире, где был отдан Дарту Сидиусу на обучение. Сидиус отправил юного забрака в учебный центр на Мустафаре, где начал тренировать его. Дарт Мол стал мастером Джуйо, Ниман/Джар'Кай и Терас-каси. Для победы над джедаем Сайоло'урманкой Мол создал собственный двухклинковый световой меч. Его обучение нарушало Правило двух, потому что его собственный учитель был в то время учеником другого лорда ситхов, Дарта Плэгаса. В 33 ДБЯ Мол совершил нападение на преступную организацию «Чёрное солнце», убив многих её лидеров, в том числе Алекси Гарина. В 32 ДБЯ он был назначен главнокомандующим войсками Торговой федерации на оккупированной планете Набу. Во время битвы, происходившей между гунганами и боевыми дроидами неймодианцев, Мол, находившийся в столице Набу Тиде, вступил в схватку с мастером-джедаем Квай-Гоном Джинном и его падаваном Оби-Ваном Кеноби. В ходе достаточно затяжного боя ситх пронзил своим мечом Джинна, а вскоре лишил оружия и его ученика. Но двадцатидвухлетний Мол недооценил качества молодого Оби-Вана: схватив световой меч учителя, Кеноби разрубил противника пополам, и тело ситха упало в шахту. Но даже в разрубленном состоянии Мол выжил. Он упал в жидкие отходы от переработки плазмы на дне шахты и был доставлен в мусорном контейнере на планету-свалку Малый Лото. Там он сделал себе кибернетические ноги, напоминавшие паучьи лапы. Живя в пещере и питаясь неосторожными путниками, Мол медленно сходил с ума. В 20 ДБЯ брат Мола, Саваж Опресс, нашел падшего ситха. Получив от матери Талзин на Датомире новые, более мощные механические ноги и излечив свой разум, Мол объявил охоту на Кеноби. Вскоре он вместе с братом уничтожил всю деревню мирных жителей на Райдонии, чтобы привлечь внимание Оби-Вана. Кеноби прибыл на планету и попал в плен к забракам. Братья хотели убить джедая медленно и болезненно, но Кеноби удалось сбежать благодаря своему бывшему врагу Асажж Вентресс. Спустя несколько месяцев Мол снова встретился с Кеноби на Флорруме. Ситх убедил пиратов-викуэев присоединиться к его новой криминальной империи. Когда на Флоррум прибыли джедаи Оби-Ван Кеноби и Ади Галлия, братья вступили с ними в бой. Саваж Опресс убил Ади Галлию, но затем Оби-Ван отрубил Брату ночи руку. Ситхам пришлось поспешно бежать с планеты от бывших союзников-пиратов, которых Хондо Онака убедил вернуться к нему. На дрейфующий корабль братьев наткнулся Пре Визсла, лидер «Дозора смерти». Он вылечил пострадавших в схватке братьев и заключил с ними сделку — ситхи помогали «Дозору» захватить Мандалор, а Визсла с помощью герцогини Сатин Крайз заманивал Оби-Вана Кеноби к Дарту Молу. К Коллективу теней также присоединился Синдикат пайков, «Чёрное солнце» и Картель хаттов. Мандалор был захвачен, а Мол убил Визслу и стал лидером «Дозора смерти». Оби-Ван попал в ловушку ситха, и месть Мола свершилась — он казнил Сатин на глазах джедая. Однако Оби-Вану удалось сбежать, а на Мандалор прибыл Дарт Сидиус, посчитавший Мола соперником. Завязался бой, в котором Сидиус убил Саважа и победил Мола."
    },
    {
        name: 'Дарт-Тиранус',
        marks: "Лорд-Ситхов",
        actors: "Раса: Человек",
        Image: "img/pers-8.png",
        about: "Дуку (англ. Dooku) — граф Серенно, мастер-джедай и лорд ситхов, последний из двадцати мастеров, добровольно покинувших Орден джедаев. Его падаванами были Квай-Гон Джинн и Комари Воса. После перехода на Тёмную сторону Силы стал учеником Дарта Сидиуса и получил новое имя — Дарт Тиранус. Основал движение сепаратистов и стал лидером Конфедерации независимых систем (КНС). Погиб от руки Энакина Скайуокера во время второй битвы при Корусанте в самом конце Войн клонов в возрасте 83 лет. Граф Дуку был превосходным фехтовальщиком: только Йода , Оби-Ван Кеноби и Энакин Скайуокер могли противостоять ему. Дуку был мастером Макаши — второй формы боя на световых мечах. Дуку был элегантным аристократом, каким и считал себя, даже манера его речи напоминала речь человека высокого происхождения. Именно из-за своих взглядов он ушёл из Ордена джедаев, сказав, что тот предал саму идею своего существования и стал игрушкой в руках Сената и лживых коррумпированных сенаторов. Именно про это ему говорил Дарт Сидиус, и только в последние секунды жизни граф понял, что все эти годы его учитель лгал ему — Дуку был лишь инструментом для уничтожения джедаев, становления Империи и Дарта Вейдера."
    },
    {
        name: 'Гривус',
        marks: "Генерал армии дроидов",
        actors: "Раса: Калишец",
        Image: "img/pers-9.png",
        about: "Генерал Гривус (англ. Grievous) — киборг-калишец, верховный главнокомандующий армии дроидов Конфедерации независимых систем во времена большинства Войн клонов . Изначально, калийский воин с планеты Кали, он установил себе кибернетические имплантанты, чтобы увеличить свою боевую мощь. Он был нанят графом Дуку для того, чтобы возглавить Сепаратисткую Армию Дроидов, и был обучен мастерству боя на световых мечах. В течение войн клонов, Гривус наводил страх на всю Галактическую Республику своей беспощадностью и расчётливым планированием боевых действий. Калийский киборг успешно сразил многих республиканских джедаев-генералов, собрав себе коллекцию трофеев — световых мечей убитых им джедаев. Также, он не один раз сталкивался с падаваном Асокой Тано и мастером-джедаем Оби-Ваном Кеноби. Под его командованием армия дроидов сеяла опустошение по всей галактике: совершала нападения на Камино, где создавалась Великая армия Клонов; уничтожила клан Сестер Ночи из Датомира, и даже устраивала бомбардировки стратегически важного генератора энергии в столице Республики — Корусанте, чтобы продолжать войну во время ведущихся мирных переговоров. После возрождения павшего лорда ситхов, Дарта Мола, являющегося бывшим учеником Дарта Сидиуса, Гривус спровоцировал его отступление и убил Мать Талзин, бывшего лидера Сестёр Ночи. Ближе к концу войны, Гривус возглавил атаку на Корусант на борту своего флагмана «Невидимая Рука», и успешно захватил канцлера Палпатина, на самом деле являющегося Дартом Сидиусом. Однако, ему пришлось отступить ввиду смерти графа Дуку от рук Энакина Скайуокера, а также серьёзных повреждений корабля, поэтому, он был вынужден отправиться на далёкую планету Утапау. Канцлер Палпатин смог передать свои координаты Совету Джедаев, которые отправили Мастера Кеноби, чтобы убить Гривуса. Оби-Ван прибыл в Пау-Сити, небольшое шахтерское поселение, и сразился с ужасным киборгом, пока батальон клонов занялся армией дроидов. Несмотря на это, Гривус попытался сбежать в его личном звёздном истребителе — Бездушном, но Оби-Ван смог остановить его, дав ему еще один бой. Мастер Кеноби был почти повержен, но в последний момент успел выстрелить в живые органы Гривуса из бластера самого Гривуса, что привело к мгновенной кончине ужасного киборга."
    },
    {
        name: 'Джанго Фетт',
        marks: "Охотник за головами",
        actors: "Раса: Человек",
        Image: "img/pers-10.png",
        about: "Джанго Фетт (встречается перевод Дженго Фетт, англ. Jango Fett) — известный мандалорский наёмник, убийца, лучший охотник за головами своей эпохи. «Отец» Бобы Фетта, своего генетического клона, которого воспитал как собственного сына. Уроженец планеты Конкорд-Доун, Фетт стал мандалорским воином после смерти его родителей и исчезновения старшей сестры Арлы в 58 ДБЯ, после чего его усыновил Джастер Мерил. После смерти Мерила Джанго Фетт стал Мандалором. Через несколько лет он прошёл через большую часть Мандалорской гражданской войны. Позже Джанго был заключён в тюрьму джедаев за уничтожение Дозора Смерти — мандалорского клана, убившего Джастера Мерила. После завершения этого конфликта Фетт стал охотником за головами, быстро обретя репутацию одного из лучших наёмников в Галактике. Позже Фетт стал прототипом для генетических клонов, которые составили основу Великой армии Республики во время Войн клонов. Когда мастер-джедай Оби-Ван Кеноби сумел найти Джанго и Бобу на Камино, Фетты сбежали, чтобы присоединиться к графу Дуку. Во время битвы на Джеонозисе Джанго был убит Мейсом Винду."
    },
    {
        name: 'Боба Фетт',
        marks: "Охотник за головами",
        actors: "Раса: Человек(Клон)",
        Image: "img/pers-11.png",
        about: "Боба Фетт (англ. Boba Fett) — является неизменённым клоном наёмника Джанго Фетта. Другие его клоны стали частью Великой армии Республики. Джанго усыновил клона, назвал Бобой и лично тренировал. Во время битвы на Джеонозисе, которая послужила началом Войн клонов, Джанго Фетт был убит. Осиротевший Боба пошел по стопам отца, став охотником за головами. Будучи еще ребенком, Боба возглавил группу охотников, а позже выполнял заказы для Империи и Джаббы Хатта. Фетт получил самую крупную награду, когда захватил героя повстанцев и контрабандиста Хана Соло и привёз его замороженным в карбоните к Джаббе Хатту. Позже, во время перестрелки над Большой ямой Каркуна, Фетт дрался против группы повстанцев, возглавляемой Люком Скайуокером, и был случайно сброшен Ханом Соло в пасть сарлакку."
    },
    {
        name: 'Люк Скайукер',
        marks: "Мастер-Дждай ",
        actors: "Раса: Человек",
        Image: "img/pers-12.png",
        about: "Люк Скайуокер (англ. Luke Skywalker) — чувствительный к Силе человек, мастер-джедай, сыгравший ключевую роль в поражении Галактической Империи и свержении ситхов во время Галактической гражданской войны. Он был сыном падшего рыцаря-джедая Энакина Скайуокера и сенатора Падме Амидалы, приходился внуком Шми Скайуокер Ларс, племянником Оуэну и Беру Ларс и братом-близнецом Леи Органы. Рождённые 19 ДБЯ на астероиде Полис-Масса, близнецы практически сразу стали сиротами, так как их мать умерла при родах, а отец, павший на тёмную сторону Силы и принявший имя Лорда ситхов Дарт Вейдер, так и не узнал о их рождении. Люка и Лею разделили и мальчика забрал мастер-джедай Оби-Ван Кеноби, который отвёз его на планету Татуин, где передал младенца на воспитание семье Ларсов, чтобы спрятать его от Галактической Империи. На Татуине Люк рос не зная о своём происхождении, но его жизнь полностью изменилась, после того как дядя приобрёл двух дроидов, R2-D2 и C-3PO, перевозящих чертежи супероружия Империи — «Звезды Смерти». После того как его родных убили солдаты Империи, разыскивавшие чертежи, Скайуокер, потерявший всё что у него было, вместе с Кеноби отправился в опасное путешествие, чтобы доставить чертежи Альянсу повстанцев, в пути обучаясь путям Силы у старого джедая и встретившись с Ханом Соло и, ещё не зная об этом, своей сестрой, принцессой Леей Органой, членом Восстания. После того как Кеноби был убит Вейдером, Скайуокер принял участие в битве при Явине вместе с повстанцами и, направляемый духом Кеноби, смог уничтожить «Звезду Смерти». Став членом Альянса повстанцев, Люк участвовал во множестве сражений с силами Империи, возглавляемых Вейдером, который охотился за Скайуокером на протяжении последующих трёх лет. После того как повстанцам пришлось покинуть свою базу во время битвы на планете Хот, Скайуокер отправился на покрытую болотами планету Дагоба, где, следуя указаниям своего погибшего наставника Кеноби, он приступил к джедайским тренировкам под руководством мастера-джедая Йоды. Однако позже Скайуокер угодил в расставленную Вейдером ловушку в Облачном городе на Беспине, где состоялась дуэль на световых мечах между ним и Лордом ситхов, в ходе которой Вейдер раскрыл Люку, что являлся его отцом. Спустя год Скайуокер принял участие в битве при Эндоре, во время которой сумел убедить отца вернуться к свету, после чего Энакин пожертвовал собой чтобы убить Императора, Дарта Сидиуса, и уничтожить ситхов. Став рыцарем-джедаем, Скайуокер предпринял попытку обучить Лею, о родстве с которой узнал от Йоды и Кеноби, путям джедаев, но та предпочла сфокусироваться на формировании Новой Республики, после поражения Империи"
    },
    {
        name: 'Лея Органа-Соло (Скайукер)',
        marks: "Принцесса Альдераана (Лидер повстанцев)",
        actors: "Раса: Человек",
        Image: "img/pers-13.png",
        about: "Лея Скайуокер Органа Соло (англ. Leia Skywalker Organa Solo), при рождении — Лея Амидала Скайуокер (англ. Leia Amidala Skywalker), —  которая исполняла обязанности принцессы Альдераана, члена Имперского Сената, лидера Альянса за восстановление Республики и затем Новой Республики, а также являлась учредителем и генералом Сопротивления. Она сыграла важную роль в поражении Галактической Империи в Галактической гражданской войне и вела борьбу с Первым орденом после его возникновения. Лея была дочерью рыцаря-джедая Энакина Скайуокера и сенатора Падме Амидалы. Её мать умерла при родах, а отец пал на Тёмную сторону Силы и стал лордом ситхов Дартом Вейдером. Лея, которую отец считал умершей, была удочерена сенатором Бейлом Органой и его женой королевой Брехой, получив статус принцессы Альдераана. Позже она заняла место своего приёмного отца в Сенате, помогая ему вести борьбу против Империи. Во время войны с Империей Лее были доверены похищенные чертежи первой Звезды Смерти — имперского супероружия, способного уничтожать целые планеты. Находясь в плену на боевой станции, она познакомилась и подружилась с Люком Скайуокером, Ханом Соло и Чубаккой. Люк и Лея не подозревали, что были родными братом и сестрой. Новые друзья помогли принцессе бежать и доставить украденные чертежи Восстанию. После того как Звезда Смерти была уничтожена во время битвы при Явине, Лея продолжала координировать военную и политическую деятельность Альянса. Бежав с разгромленной в битве на Хоте базы повстанцев, Лея и Хан, которые к тому времени полюбили друг друга, попытались скрыться в Облачном городе на Беспине. Лорд Вейдер захватил их и использовал в качестве приманки, вынудив Люка Скайуокера прилететь на помощь. Соло был заморожен в карбоните и увезён наёмником Бобой Феттом, но остальным удалось покинуть Беспин и воссоединиться с мятежниками. Вскоре Лея приняла участие в успешной операции по спасению Хана Соло от Джаббы Хатта, во время которой она убила криминального босса, за что получила прозвище «Хаттова Смерть». В ходе битвы при Эндоре она высадилась на лесистую планету в составе команды генерала Соло с целью уничтожения генератора щита второй «Звезды Смерти». Там Лея узнала, что Дарт Вейдер был её отцом, а Люк Скайуокер — братом. Вейдер и Император (лорд ситхов Дарт Сидиус) во время этой битвы погибли."
    },
    {
        name: 'Хан Соло',
        marks: "Контрабандист(в прошлом)",
        actors: "Раса: Человек",
        Image: "img/pers-14.png",
        about: "Хан Соло (англ. Han Solo) — человек выросший в нищете в трущобах Коронет-Сити. Отслужив три года в армии Галактической Империи на Мимбане, он, вместе с освобождённым им вуки Чубаккой, смог прибиться к команде наёмника Тобиаса Беккета, с которым поучаствовал в добыче коаксиума для Багрового рассвета. Благодаря своей удаче и смекалке, он выиграл у капитана Лэндо Калриссиана в сабакк его корабль, «Тысячелетний сокол». Вместе с Чуи Хан стал промышлять контрабандой по галактике на своём новом корабле, от Корусанта до Татуина. Через девятнадцать лет после создания Галактической Империи Хан задолжал крупную сумму своему нанимателю, хатту Джаббе, криминальному повелителю Татуина. Пытаясь решить проблемы с долгом, Хан согласился довезти до Альдераана двоих мужчин, которым были джедай Оби-Ван Кеноби и молодой Люк Скайоукер, и их дроидов. У Альдераана они обнаружили «Звезду Смерти», с борта которой спасли принцессу Лею Органу. Вернувшись на тайную базу Альянса повстанцев на Явине-4, он оказался втянут в Галактическую гражданскую войну Альянса против Империи, участвовал в битве при Явине, оказав Люку помощь в уничтожении супероружия, а в последующие годы Соло сражался на стороне восстания, приняв участие во множестве операций против Империи, от Саймуна 1 до Джеды и Мон-Калы. После событий на Хоте, когда Империя уничтожила тайную базу повстанцев, Хан попытался найти убежище для себя и Леи в Облачном городе, которым управлял его старый знакомый, Калриссиан. Тем не менее, тот оказался предателем, и выдал повстанцев Дарту Вейдеру. Соло был заморожен в карбоните и переправлен наёмником Бобой Феттом к Джаббе на Татуин, а Люк и Лея едва смогли сбежать из ловушки, уготовленной ситхом. С помощью Маз Канаты, старой подруги Хана, Лее, Лэндо и Люку удалось разработать и воплотить план по спасению Хана из дворца Джаббы. После возвращения к Альянсу Соло возглавил отряд Следопытов, которому предстояло уничтожить генератор щита новой, второй «Звезды Смерти» на поверхности небольшого спутника Эндор во Внешнем Кольце. Заручившись поддержкой местных аборигенов, эвоков, Хан и товарищи смогли справиться с имперцами. Их действия сыграли решающую роль в победе над Империей. Вскоре после у него и принцессы Леи состоялась свадьба."
    },
    {
        name: 'Падме Амидала,',
        marks: "Королева и сенатор планеты Набу",
        actors: "Раса: Человек",
        Image: "img/pers-15.png",
        about: "Падме Амидала (англ. Padmé Amidala) — женщина которая была королевой, а затем сенатором от планеты Набу. Была тайной женой Энакина Скайуокера. У них родилось двое детей: Люк и Лея, которые стали двумя самыми значимыми фигурами всей галактической истории. Как королева Набу, она отстаивала права и свободы местных жителей, что сделало её самым уважаемым политиком в Галактике. Несмотря на короткую жизнь, она сыграла важную роль в политических событиях в преддверии Войн клонов."
    },
    {
        name: 'Бейл Органа',
        marks: "Сенатор планеты Альдераан",
        actors: "Раса: Человек",
        Image: "img/pers-16.png",
        about: "Бейл Органа (англ. Bail Organa) — политик бывший сенатором от Альдераана в последние годы Галактической Республики. Будучи мужем и консортом королевы Брехи Органы, Бейл Органа носил титул вице-короля и первого председателя Альдераана, и был одним из основателей Альянса за восстановление Республики, во время правления Императора Шива Палпатина и Галактической Империи. Вместе со своей женой они были приёмными родителями Леи Органы, тайной дочери падшего рыцаря-джедая Энакина Скайуокера и покойного сенатора Падме Амидалы с Набу, которая была близким другом и коллегой Бейла в период Войн клонов. Воспитанная родителями как наследная принцесса Альдераан, Лея в итоге пошла по стопам отца и слала представителем Альдераана в Имперском Сенате, а также была одним из руководящих членов Альянса повстанцев."
    },
    {
        name: 'Джабба Хатт',
        marks: "Лорд криминального мира",
        actors: "Раса: Хатт",
        Image: "img/pers-17.png",
        about: "Джабба Десилиджик Тиуре, также известный как Джабба Хатт или просто Джабба, был хаттом, гангстером и криминальным лордом, орудующим из своего дворца на Татуине. Джабба был ключевой фигурой на Татуине, контролируя большую часть торговли незаконными товарами, пиратство и рабство, обогатившее планету. Также он контролировал космопорты и поселения на планете. У Джаббы был сын Ротта. Джабба Хатт был убит во время штурма Баржи Кетанны. Он скончался от того, что Лея Органа, которая на тот момент была его рабыней, задушила его цепью, в которую она была закована."
    },
    {
        name: 'С-3po(Cитрипио)',
        marks: "Протокольный дроид",
        actors: "Раса: -----",
        Image: "img/pers-18.png",
        about: "C-3PO, или, как его иногда называли Си-Трипио, а чаще всего просто Трипио — двуногий человекоподобный протокольный дроид серии 3PO, созданный для взаимодействия с живыми существами различных рас и запрограммированный в качестве консультанта по этикету и переводчика. Он свободно владел более чем шестью миллионами форм общения, и за многие десятилетия существования выработал свою собственную манеру поведения и обзавёлся такими индивидуальными чертами как суетливость и беспокойство. Вместе со своим товарищем дроидом-астромехаником R2-D2, C-3PO то и дело оказывался втянут в множество решающих исторических событий в судьбе галактики, и не раз становился её спасителем. C-3PO был собран из запчастей человеком Энакином Скайуокером, который был рабом, жившим в Мос Эспа, городе на Татуине, что во Внешнем Кольце. Память C-3PO была стёрта. Позже его вместе с R2-D2 направили на Альдераанский корабль Тантив IV, который принадлежал сенатору Бейлу Органе. Там дроиды отслужили 19 лет. В какой-то момент в этот отрезок времени, C-3PO получил несоответствующую его корпусу обшивку на правой ноге. Позже они оказались втянуты в Галактическую гражданскую войну, когда Лея Органа из Альянса повстанцев поручила им доставить копию планов Звезды Смерти мастеру-джедаю Оби-Вану Кеноби на Татуин. После встречи с сыном Скайуокера Люком и контрабандистом Ханом Соло, дроиды помогли спасти принцессу Лею с имперской Звезды Смерти. Они стали постоянными спутниками этой троицы из Альянса и помогли им победить Империю и восстановить свободу в галактике. C-3PO внёс неоценимый вклад в победу, убедив эвоков оказать повстанцам поддержку во время битвы при Эндоре. После битвы при Эндоре С-3РО продолжил служить Скайуокеру и Соло во времена Новой Республики. Спустя примерно тридцать лет после битвы при Эндоре, C-3PO служил в качестве помощника Лее Органе, которая стала генералом Сопротивления, частной военной группы, выступающей против Первого ордена, военной хунты, созданной из остатков Империи. В это время C-3PO был оборудован красной левой рукой, а его база данных переводчика была обновлена до семи миллионов форм общения."
    },
    {
        name: 'R2-D2',
        marks: "Дроид-Астромеханик",
        actors: "Раса: -----",
        Image: "img/pers-19.png",
        about: "R2-D2, называемый Арту-диту, Ардва-дидва или, зачастую, кратко Ардва, был астромеханичским дроидом серии R2. Вместе со своим приятелем, протокольным дроидом C-3PO, R2-D2 принимал непосредственное участие в ключевых моментах галактической истории. Изобретательный и смелый, дроид развил свою авантюрную личность, побывав во множестве, зачастую опасных, приключений за долгие десятилетия своей жизни. Его храбрость, в сочетании с большим количеством разнообразных гаджетов, сыграли большую роль в тяжёлые для галактики времена. В последние годы Галактической Республики, R2-D2 служил на борту королевского звёздного корабля «Нубиан» 327 типа «J», принадлежавшего королеве Падме Амидале, когда Торговая федерация установила блокаду её родной планеты Набу. Во время побега королевы с планеты, её корабль был подбит и R2-D2, в группе других астродроидов, был вызван для починки генератора поля, находящегося под вражеским обстрелом корабля. В процессе ремонта, все дроиды из ремонтной группы бли уничтожены и R2-D2 в одиночку смог восстановить работоспособность защитного поля. За свою работу по спасению корабля, R2-D2 был представлен лично королеве. После этого, R2-D2 служил непосредственно королеве, сыграв ключевую роль во время освобождения Набу и оставшись при Амидале на последующее десятилетие, даже после того, как она стала сенатором восемью годами спустя. Когда было совершено покушение на её жизнь, и джедай-падаван Энакин Скайуокер был назначен её телохранителем, R2-D2 и C-3PO сопровождали их на Джеонозисе, где приняли участие в первой битве Войн клонов, крупного галактического конфликта, между Галактической Республикой и Конфедерацией независимых систем. R2-D2 был подарен Скайуокеру Амидалой после того, как тот принял титул рыцаря-джедая, и астродроид верой и правдой служил ему на протяжении всей войны, зачастую выполняя роль второго пилота в истребителях Скайуокера или сражаясь рядом с ним на поле боя. На самом деле война была развязана Верховным Канцлером Республики Шивом Палпатином, который тайно был Лордом ситхов Дартом Сидиусом, и который положил конец конфликту спустя три года, сделав Скайуокера своим учеником, и инициировавший масштабную компанию по уничтожению джедаев, а после преобразовавший Республику в Первую Галактическую Империю. После окончания войны, R2-D2 и C-3PO были приписаны к Альдераанскому крейсеру «Тантив IV», на котором служили сенатору Бейлу Органе на протяжении девятнадцати лет. Именно в этот период они были втянуты в Галактическую гражданскую войну, и принцесса Лея Органа из Альянса повстанцев поручила R2-D2 доставить копию планов «Звезды Смерти» мастеру-джедаю Оби-Вану Кеноби на Татуин. После встречи с сыном Скайуокера — Люком и контрабандистом Ханом Соло, дроиды помогли им освободить Лею из камеры Имперской Звезды Смерти, и это связало трёх людей и дроидов, которые помогли им и Восстанию победить Империю и принести свободу Галактике."
    },
    {
        name: 'Лэндо Калриссиан',
        marks: "Контрабандист",
        actors: "Раса: Человек",
        Image: "img/pers-20.png",
        about: "Лэндонис Бальтазар «Лэндо» Калриссиан (англ. Landonis Balthazar (Lando Calrissian)) —человек с планеты Сокорро, игрок и авантюрист, долгое время занимавшийся тёмными делами в галактике, от незаконной добычи руды до контрабанды и шулерства. Бывший владелец «Тысячелетнего сокола» — он проиграл его другому контрабандисту, Хану Соло, в сабакк. После нескольких попыток разбогатеть с помощью компрессионных свиней на Лотале, Лэндо вернулся к своим старым авантюрам, и, в конце концов, вместе с Лоботом, своим верным товарищем, он залез в долги перед криминальным авторитетом Тореном, и был вынужден угнать для него яхту с верфей Кастелла. Как оказалось, её владельцем был сам Император Палпатин, и Лэндо едва не погиб во время миссии.  В конце концов, Лэндо и Лобот осели на Беспине в Облачном городе, где Калриссиан стал бароном-администратором. В разгар Галактической гражданской войны в вотчину Лэндо прилетел Дарт Вейдер, имперский военачальник, чтобы подстроить ловушку своему сыну-джедаю и его товарищам-повстанцам. Лэндо обманул своих гостей — Хана, принцессу Лею и прочих — и заманил в ловушку, после чего сдал врагам. Несмотря на сделку с Империей, Лэндо понял, что те перешли все границы, когда штурмовики выдали Хана Соло Бобе Фетту, и предупредил жителей об угрозе от Империи, начав эвакуацию. В конце концов, он сам присоединился к Альянсу, получив звание генерала. Вместе с Люком и Леей он поучаствовал в освобождении Хана из дворца Джаббы Хатта на Татуине, а затем возглавил нападение на вторую «Звезду Смерти» во время битвы при Эндоре. Именно выстрел Калриссиана с борта «Сокола» стал решающим в уничтожении боевой станции."
    },
    {
        name: 'Чубакка',
        marks: "Друг Хана Соло",
        actors: "Раса: Вуки",
        Image: "img/pers-21.png",
        about: "Чубакка (друзья называли его Чуи) — родом с Кашиика. Он был вторым пилотом на корабле Хана Соло − «Тысячелетнем соколе». Чубакка принимал участие в битвах на Кашиике, Эндоре "
    },
    {
        name: 'Джиал Акбар',
        marks: "Адмирал повстанцев",
        actors: "Раса: Мон-каламари",
        Image: "img/pers-22.png",
        about: "Джиал Акбар (англ. Gial Ackbar) - мон-каламари, служивший во время Войн клонов капитаном гвардии своего народа и принимавший участие в на стороне принца Ли-Чар, в его битве за трон короля Мон-Калы. Позже он стал выдающимся командующим вооружённых сил Альянса за восстановление Республики в Галактической гражданской войне и символом борьбы против порабощения Галактической Империей представителей нечеловеческих рас. Также оказал Восстанию огромную поддержку, выступив с армадой звёздных крейсеров Дака на его стороне, тем самым усилив флот Альянса. С корабля «Дом Один», адмирал Акбар осуществлял управление войсками Альянса во время битвы при Эндоре, попавшими в имперскую западню во время секретной операции у второй Звезды Смерти. Лэндо Калриссиан возглавил несколько звеньев звёздных истребителей, которые в итоге уничтожили вышеупомянутую боевую станцию."
    },
    {
        name: 'Джа-Джа Бинкс',
        marks: "Представитель раси Гунганов",
        actors: "Раса: Гунган",
        Image: "img/pers-23.png",
        about: "Джа-Джа Бинкс (англ. Jar Jar Binks) был из расы гунганов, военным офицером и политиком в период заката Галактической Республики. В какой-то период жизни он был изгнан из гунганского сообщества за свою неуклюжесть, однако вскоре, за действия в период вторжения Торговой федерации на Набу, он был вновь принят своим народом. Бинкс помог Квай-Гону Джинну и Оби-Вану Кеноби спасти королеву Набу, Падме Амидалу, и вместе с ней и джедаями посетил отдалённую планету Татуин и столицу Республики Корусант, прежде чем вновь вернуться на родину, для освобождения её от сил Федерации. После возвращения, Бинк поспособствовал заключению союза между гунганами и набуанцами, положив конец многим годам взаимного недоверия. За свои заслуги ему было присвоено звание бомбад-генерала, под котором он в составе Великой армии гунганов участвовал в битве за Набу. В последующие годы Бинкс стал младшим представителем своего народа в Галактическом Сенате, служа там вместе с Амидалой, когда та стала сенатором от Набу. С возникновением политической напряжённости между Республикой и Конфедерацией независимых систем на Амидалу, выступавшую с жёсткой критикой военного наращивания, было совершено покушение, с целью её убийства. Вынужденная скрываться, Амидала оставила Бинса представителем Набу в Сенате. Гунган поддался влиянию Верховного Канцлера Шива Палпатина, который в тайне от всех был Лордом ситхов Дартом Сидиусом, и внёс в Сенат предложение наделить Канцлера чрезвычайными полномочиями, что позволило ему создать армию для борьбы с сепаратистами. Это действие привело к созданию армии, которую Республика применила в Войнах клонов — войне, развязной лично Палпатином, чтобы получить полный контроль над Республикой. В период войны Бинкс исполнял роль дипломата. Он участвовал в переговорах по созданию на Тойдарии промежуточной базы снабжения, для оказания помощи тви’лекам на Рилоте. Позже он помог спасти королеву Джулию с Бардотты, став её другом. В конце Войн клонов Бинкс присутствовал в Сенате, когда Палпатин преобразовал Республику в Галактическую Империю, тем самым превратив Галактический Сенат в Имперский Сенат. Вскоре после этого, Бинкс присутствовал на похоронах Амидалы в Тиде."
    },
    {
        name: 'Уотто',
        marks: "Многогранный Торговец",
        actors: "Раса: Тойдарианец",
        Image: "img/pers-24.png",
        about: "Уотто (англ. Watto) — тойдарианец, хозяин магазина запчастей в Мос Эспа на планете Татуин. Несмотря на внешнюю неприглядность и малый размер магазина и его хозяина, в нем всегда можно было найти самые разные запчасти и детали в хорошем состоянии. Также являлся рабовладельцем, в числе его рабов были Энакин Скайуокер и Шми Ларс Скайуокер."
    },
]
let app = {
    data() {
        return {
            films: films,
            searchString: "",
            currentIndex: -1,
            modalWindow: -1,
            showPage: false,
        }
    },
    mounted(){
        this.funcShowPage()
    },
    methods: {
        funcShowPage(){
            setTimeout(()=>{this.showPage = true} ,1000)
        },
        showAbout(index) {
            this.currentIndex = index
        },
        hideAbout() {
            this.currentIndex = -1
        },
        showModal(index){
            this.modalWindow = index
        },
        hideModal(){
            this.modalWindow = -1
        },
    },
    computed: {
        myFilter() {
            let serch = this.searchString
            if (!serch) {
                return this.films
            }
            serch = serch.trim().toLowerCase()
            return this.films.filter(
                item => {
                    if (item.name.toLowerCase().indexOf(serch) != -1) {
                        return item
                    }
                }
            )




        }
    },
}
Vue.createApp(app).mount("#film-app")




let animElemets4 = document.querySelectorAll('.my-anim-bottom');
if (animElemets4.length > 0) {
    for (let i = 0; i < animElemets4.length; i++) {
        let item = animElemets4[i];
        window.addEventListener('scroll', () => {
            myAnimScroll(item, 'activ-anim-bottom')
        })
        myAnimScroll(item, 'activ-anim-bottom');
    }
}

function myAnimScroll(elem, className) {
    let elemHeight = elem.offsetHeight; //висота об'єкту
    let elemPosition = positionTop(elem); //позиція елементу відносно верху
    let koef = 4; //запускатимемо анімацію на 1/4 блоку
    let startAnim = window.innerHeight - elemHeight / koef; // віднімаємо від висоти вікна 1/4 висоти елементу
    if (elemHeight > window.innerHeight) { //якщо елемент вищий ніж вікно
        startAnim = window.innerHeight - window.innerHeight / koef; // віднімаємо від висоти вікна 1/4 висоти елементу
    }
    // pageYOffset - скільки пікселів прокручено - вбудован змінна в js
    if ((pageYOffset > elemPosition - startAnim) && pageYOffset < (elemPosition + elemHeight)) {
        elem.classList.add(className);
    } else {
        if (!elem.classList.contains('no-anim-again')) {
            elem.classList.remove(className);
        }
    }
}
function positionTop(param) {
    let rect = param.getBoundingClientRect();
    console.log(rect);
    let scrollTop = window.pageYOffset || document.documentElement.scrollTop;
    return rect.top + scrollTop

}
// кінець робочих функцій



